In [1]:
import numpy as np
import pandas as pd

# Loading the first dataframe for analysis

In [2]:
#loading the first dataframe
Jan22=pd.read_csv('Datasets/pub0122.csv')

In [3]:
#exploring the head of the Jan data
Jan22.head()

,REC_NUM,SURVYEAR,SURVMNTH,LFSSTAT,PROV,CMA,AGE_12,AGE_6,SEX,MARSTAT,...,LKATADS,LKANSADS,LKOTHERN,PRIORACT,YNOLOOK,TLOLOOK,SCHOOLN,EFAMTYPE,AGYOWNK,FINALWT
0,1,2022,1,1,59,0,8,NaN,1,1,...,NaN,NaN,NaN,NaN,NaN,NaN,1.0,6,3.0,133
1,2,2022,1,1,12,0,6,NaN,2,6,...,NaN,NaN,NaN,NaN,NaN,NaN,1.0,18,NaN,135
2,3,2022,1,4,46,6,11,NaN,1,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11,NaN,95
3,4,2022,1,2,35,4,5,NaN,2,6,...,NaN,NaN,NaN,NaN,NaN,NaN,1.0,1,NaN,1118
4,5,2022,1,1,24,0,7,NaN,2,1,...,NaN,NaN,NaN,NaN,NaN,NaN,1.0,3,3.0,115

In [11]:
#listing required columns based on specification
reqcols=['SURVMNTH','LFSSTAT','PROV','AGE_12','SEX','EDUC',
         'NAICS_21','NOC_10','NOC_40','COWMAIN','FTPTMAIN']

In [15]:
Jan22[reqcols].info()
#here we can see some of the required columns' data types does not align with the requirement, will need to perform
#data transformation on the types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97899 entries, 0 to 97898
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   SURVMNTH  97899 non-null  int64
 1   LFSSTAT   97899 non-null  int64
 2   PROV      97899 non-null  int64
 3   AGE_12    97899 non-null  int64
 4   SEX       97899 non-null  int64
 5   EDUC      97899 non-null  int64
 6   NAICS_21  62804 non-null  float64
 7   NOC_10    62804 non-null  float64
 8   NOC_40    62804 non-null  float64
 9   COWMAIN   62804 non-null  float64
 10  FTPTMAIN  55216 non-null  float64
dtypes: float64(5), int64(6)
memory usage: 8.2 MB

# Loading reference files

In [20]:
#loading the required files to derive string values for the specified columns

lfsstat=pd.read_csv('Datasets/ref_lfsstat.csv')
sex=pd.read_csv('Datasets/ref_sex.csv')
ftptmain=pd.read_csv('Datasets/ref_ftptmain.csv')
whypt=pd.read_csv('Datasets/ref_whypt.csv')

# Unit test - Use Jan file to conduct all transformations before writting the function to convert all other months

Note: I am going to be using English labels for merging to enhance readability of the data.

To use French labels, subsitute 'en_label' with 'fr_label' in the code.

Converting LFSSTAT

In [64]:
#merging one row of this column as specified
Jan22['LFSSTAT'].values[1].astype(str)+'-'+lfsstat[lfsstat['code']==Jan22['LFSSTAT'].values[1]]['en_label'][0]

'1-Employed, at work'

In [31]:
#checking the unique values of specified column
Jan22['LFSSTAT'].unique()

array([1, 4, 2, 3], dtype=int64)

In [32]:
#checking conversion reference file
lfsstat

   code                    en_label                                 fr_label
0     1           Employed, at work           Personnes occupées, au travail
1     2  Employed, absent from work  Personnes occupées, absentes du travail
2     3                  Unemployed                                 Chômeurs
3     4         Not in labour force                                 Inactifs

In [71]:
#mapping and merging entire column for January file with the reference file 
Jan22['LFSSTAT']=Jan22['LFSSTAT'].map(lambda x: str(x)+'-'+(lfsstat['en_label'][lfsstat['code']==x].values[0]))

#checking head of the newly merged dataframe
Jan22[reqcols].head()

,SURVMNTH,LFSSTAT,PROV,AGE_12,SEX,EDUC,NAICS_21,NOC_10,NOC_40,COWMAIN,FTPTMAIN
0,1,"1-Employed, at work",59,8,1,5,14.0,3.0,10.0,6.0,2.0
1,1,"1-Employed, at work",12,6,2,6,16.0,5.0,16.0,1.0,1.0
2,1,4-Not in labour force,46,11,1,2,6.0,8.0,29.0,6.0,NaN
3,1,"2-Employed, absent from work",35,5,2,6,14.0,2.0,5.0,2.0,1.0
4,1,"1-Employed, at work",24,7,2,4,17.0,5.0,18.0,1.0,1.0

Converting SEX

In [72]:
#checking unique values for SEX column
Jan22['SEX'].unique()

array([1, 2], dtype=int64)

In [74]:
#mapping and merging entire column for January file with the reference file 
Jan22['SEX']=Jan22['SEX'].map(lambda x: str(x)+'-'+(sex['en_label'][sex['code']==x].values[0]))

#checking head of the newly merged dataframe
Jan22[reqcols].head()

,SURVMNTH,LFSSTAT,PROV,AGE_12,SEX,EDUC,NAICS_21,NOC_10,NOC_40,COWMAIN,FTPTMAIN
0,1,"1-Employed, at work",59,8,1-Male,5,14.0,3.0,10.0,6.0,2.0
1,1,"1-Employed, at work",12,6,2-Female,6,16.0,5.0,16.0,1.0,1.0
2,1,4-Not in labour force,46,11,1-Male,2,6.0,8.0,29.0,6.0,NaN
3,1,"2-Employed, absent from work",35,5,2-Female,6,14.0,2.0,5.0,2.0,1.0
4,1,"1-Employed, at work",24,7,2-Female,4,17.0,5.0,18.0,1.0,1.0

Converting FTPTMAIN

In [78]:
#checking unique values for FTPTMAIN column
Jan22['FTPTMAIN'].unique()

array([ 2.,  1., nan])

In [83]:
#count the number of NAs
Jan22['FTPTMAIN'].isna().sum()

42683

In [85]:
#since there are NA values, we will map these to 0
#this is consistent with how NAs are treated in the previous excercies when compiling the reference files

Jan22['FTPTMAIN']=Jan22['FTPTMAIN'].fillna(0)

In [87]:
#confirming all the NAs have been replaced
Jan22[Jan22['FTPTMAIN']==0]['FTPTMAIN'].count()

42683

In [89]:
#converting to integer to ensure consistentcy in format
Jan22['FTPTMAIN']=Jan22['FTPTMAIN'].astype('int64')
Jan22['FTPTMAIN'].head()

0    2
1    1
2    0
3    1
4    1
Name: FTPTMAIN, dtype: int64

In [90]:
#mapping and merging entire column for January file with the reference file 
Jan22['FTPTMAIN']=Jan22['FTPTMAIN'].map(lambda x: str(x)+'-'+(ftptmain['en_label'][ftptmain['code']==x].values[0]))

#checking head of the newly merged dataframe
Jan22[reqcols].head()

,SURVMNTH,LFSSTAT,PROV,AGE_12,SEX,EDUC,NAICS_21,NOC_10,NOC_40,COWMAIN,FTPTMAIN
0,1,"1-Employed, at work",59,8,1-Male,5,14.0,3.0,10.0,6.0,2-Part-time
1,1,"1-Employed, at work",12,6,2-Female,6,16.0,5.0,16.0,1.0,1-Full-time
2,1,4-Not in labour force,46,11,1-Male,2,6.0,8.0,29.0,6.0,0-Not applicable
3,1,"2-Employed, absent from work",35,5,2-Female,6,14.0,2.0,5.0,2.0,1-Full-time
4,1,"1-Employed, at work",24,7,2-Female,4,17.0,5.0,18.0,1.0,1-Full-time

Converting voluntary_pt

In [91]:
#the description for this ask is: Derived Column – TRUE if Part-time is voluntary else FALSE

#Here are the values for whypt:

In [92]:
whypt

,code,en_label,fr_label
0,0,Other reasons,Autre raisons
1,1,Own illness or disability,Maladie ou incapacité
2,2,Caring for children,Soins des enfants
3,3,Other personal or family responsibilities,Autres obligations personnelles ou familiales
4,4,Going to school,École
5,5,Personal preference,Choix personnel
6,6,Business conditions or could not find full-tim...,Conjoncture économique ou n'a pu trouver du tr...
7,7,Business conditions or could not find full-tim...,Conjoncture économique ou n'a pu trouver du tr...
8,0,Not applicable,Indisponible

In [93]:
#Given above information, I made the assumption that we are to derive the column as True if reason for
#part-time is 5 - Personal preference. For all other values, I will derive the column as false

In [100]:
#assigning True to 5, False for over values in WHYPT column
Jan22['VOLUNTARY_PT']=np.where(Jan22['WHYPT']==5,
                               True,
                               False)

In [103]:
#checking how many true and false are there
Jan22['VOLUNTARY_PT'].value_counts()

False    94830
True      3069
Name: VOLUNTARY_PT, dtype: int64

In [104]:
#ensuring derived column is boolean
Jan22['VOLUNTARY_PT'].dtypes

dtype('bool')

Converting QUATER

In [110]:
#creating a dictionary to bucket months into quarters

quarters={1:'2022Q1',
         2:'2022Q1',
         3:'2022Q1',
         4:'2022Q2',
         5:'2022Q2',
         6:'2022Q2',
         7:'2022Q3',
         8:'2022Q3',
         9:'2022Q3'}

In [112]:
#mapping QUARTER from the dictionary created

Jan22['QUARTER']=Jan22['SURVMNTH'].map(quarters)

In [113]:
#looking at head of new column - should all be 2022Q1
Jan22['QUARTER'].head()

0    2022Q1
1    2022Q1
2    2022Q1
3    2022Q1
4    2022Q1
Name: QUARTER, dtype: object

In [121]:
#taking a final look on derived columns

Jan22[reqcols+['QUARTER','VOLUNTARY_PT']].head()

,SURVMNTH,LFSSTAT,PROV,AGE_12,SEX,EDUC,NAICS_21,NOC_10,NOC_40,COWMAIN,FTPTMAIN,QUARTER,VOLUNTARY_PT
0,1,"1-Employed, at work",59,8,1-Male,5,14.0,3.0,10.0,6.0,2-Part-time,2022Q1,False
1,1,"1-Employed, at work",12,6,2-Female,6,16.0,5.0,16.0,1.0,1-Full-time,2022Q1,False
2,1,4-Not in labour force,46,11,1-Male,2,6.0,8.0,29.0,6.0,0-Not applicable,2022Q1,False
3,1,"2-Employed, absent from work",35,5,2-Female,6,14.0,2.0,5.0,2.0,1-Full-time,2022Q1,False
4,1,"1-Employed, at work",24,7,2-Female,4,17.0,5.0,18.0,1.0,1-Full-time,2022Q1,False

In [122]:
#creating a final dataframe for all transformed data
Jan22f=Jan22[reqcols+['QUARTER','VOLUNTARY_PT']]

#checking final dataframe's data type complies with requirement
Jan22f.dtypes

SURVMNTH          int64
LFSSTAT          object
PROV              int64
AGE_12            int64
SEX              object
EDUC              int64
NAICS_21        float64
NOC_10          float64
NOC_40          float64
COWMAIN         float64
FTPTMAIN         object
QUARTER          object
VOLUNTARY_PT       bool
dtype: object

# Writing function for data conversion

In [157]:
# this is the working function that transforms each monthly file

def transformations(df):
    """Input dataframe to apply all required transformations: all monthly files,
        Return transformed dataform specified in requirement."""
    
    #creating transformations for LFSSTAT
    df['LFSSTAT']=df['LFSSTAT'].map(lambda x: str(x)+'-'+(lfsstat['en_label'][lfsstat['code']==x].values[0]))
    
    #creating transformations for SEX
    df['SEX']=df['SEX'].map(lambda x: str(x)+'-'+(sex['en_label'][sex['code']==x].values[0]))
    
    #creating transformations for FTPTMAIN
    df['FTPTMAIN']=df['FTPTMAIN'].fillna(0)
    df['FTPTMAIN']=df['FTPTMAIN'].map(lambda x: str(x)+'-'+(ftptmain['en_label'][ftptmain['code']==x].values[0]))
    
    #deriving value of VOLUNTARY_PT based on WHYPT
    df['VOLUNTARY_PT']=np.where(df['WHYPT']==5,
                               True,
                               False)
    
    #deriving value of QUARTERS based on SURVMNTH
    df['QUARTER']=df['SURVMNTH'].map(quarters)
    
    return df[reqcols+['QUARTER','VOLUNTARY_PT']]

In [156]:
def trans_debug(df):
     """This function can be ignored as it is created to assist in debugging of f(transformations)"""
    
#     #creating transformations for LFSSTAT
#     df['LFSSTAT']=df['LFSSTAT'].map(lambda x: str(x)+'-'+(lfsstat['en_label'][lfsstat['code']==x].values[0]))
    
# #     #creating transformations for SEX
# #     df['SEX']=df['SEX'].map(lambda x: str(x)+'-'+(sex['en_label'][sex['code']==x].values[0]))
    
# #     #creating transformations for FTPTMAIN
# #     df['FTPTMAIN']=df['FTPTMAIN'].fillna(0)
# #     df['FTPTMAIN']=df['FTPTMAIN'].map(lambda x: str(x)+'-'+(ftptmain['en_label'][ftptmain['code']==x].values[0]))
    
# #     #deriving value of VOLUNTARY_PT based on WHYPT
# #     df['VOLUNTARY_PT']=np.where(df['WHYPT']==5,
# #                                True,
# #                                False)
    
# #     #deriving value of QUARTERS based on SURVMNTH
# #     df['QUARTER']=df['SURVMNTH'].map(quarters)
    
     return df

# Importing monthly files

In [167]:
Feb22=pd.read_csv('Datasets/pub0222.csv')
Mar22=pd.read_csv('Datasets/pub0322.csv')
Apr22=pd.read_csv('Datasets/pub0422.csv')
May22=pd.read_csv('Datasets/pub0522.csv')
Jun22=pd.read_csv('Datasets/pub0622.csv')
Jul22=pd.read_csv('Datasets/pub0722.csv')
Aug22=pd.read_csv('Datasets/pub0822.csv')
Sep22=pd.read_csv('Datasets/pub0922.csv')

# Applying transformations for each monthly file imported

Since the transformations take a while to complete for each monthly file, I decided to separate each transformation
in different code blocks and run each one individually, that way if something goes wrong I can immediately point out
where the error occured

In [144]:
#Feb file transformation
Feb22f=transformations(Feb22)

In [146]:
#checking the transformation worked as expected
Feb22f.head()

,SURVMNTH,LFSSTAT,PROV,AGE_12,SEX,EDUC,NAICS_21,NOC_10,NOC_40,COWMAIN,FTPTMAIN,QUARTER,VOLUNTARY_PT
0,2,4-Not in labour force,35,1,2-Female,1,10.0,7.0,25.0,2.0,0.0-Not applicable,2022Q1,False
1,2,4-Not in labour force,10,2,2-Female,3,17.0,5.0,18.0,2.0,0.0-Not applicable,2022Q1,False
2,2,4-Not in labour force,35,7,2-Female,5,NaN,NaN,NaN,NaN,0.0-Not applicable,2022Q1,False
3,2,4-Not in labour force,24,12,1-Male,1,19.0,8.0,32.0,2.0,0.0-Not applicable,2022Q1,False
4,2,4-Not in labour force,47,10,1-Male,4,10.0,7.0,24.0,2.0,0.0-Not applicable,2022Q1,False

In [158]:
#Mar file transformation
Mar22f=transformations(Mar22)

In [168]:
#Apr file transformation
Apr22f=transformations(Apr22)

In [169]:
#May file transformation
May22f=transformations(May22)

In [170]:
#Jun file transformation
Jun22f=transformations(Jun22)

In [179]:
#Jul file transformation
Jul22f=transformations(Jul22)

In [172]:
#Aug file transformation
Aug22f=transformations(Aug22)

In [173]:
#Sep file transformation
Sep22f=transformations(Sep22)

# Combine all transformed dataframes

In [180]:
#Consolidating all dataframe ready for transformation into a list

FinalList=[Jan22f,
           Feb22f,
           Mar22f,
           Apr22f,
           May22f,
           Jun22f,
           Jul22f,
           Aug22f,
           Sep22f]

In [181]:
#combining all dataframes into FinalDF
FinalDF=pd.concat(FinalList)

In [182]:
#checking Final DF
FinalDF.tail()

,SURVMNTH,LFSSTAT,PROV,AGE_12,SEX,EDUC,NAICS_21,NOC_10,NOC_40,COWMAIN,FTPTMAIN,QUARTER,VOLUNTARY_PT
110434,9,"1-Employed, at work",13,9,2-Female,4,10.0,7.0,25.0,2.0,2.0-Part-time,2022Q3,True
110435,9,4-Not in labour force,24,9,1-Male,5,18.0,3.0,11.0,1.0,0.0-Not applicable,2022Q3,False
110436,9,"1-Employed, at work",59,5,1-Male,6,14.0,2.0,5.0,2.0,1.0-Full-time,2022Q3,False
110437,9,"1-Employed, at work",35,10,2-Female,4,15.0,1.0,2.0,2.0,1.0-Full-time,2022Q3,False
110438,9,"1-Employed, at work",35,6,2-Female,4,17.0,4.0,12.0,1.0,1.0-Full-time,2022Q3,False

In [183]:
#Checking details for FinalDF
FinalDF.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 977017 entries, 0 to 110438
Data columns (total 13 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   SURVMNTH      977017 non-null  int64
 1   LFSSTAT       977017 non-null  object
 2   PROV          977017 non-null  int64
 3   AGE_12        977017 non-null  int64
 4   SEX           977017 non-null  object
 5   EDUC          977017 non-null  int64
 6   NAICS_21      635925 non-null  float64
 7   NOC_10        635925 non-null  float64
 8   NOC_40        635925 non-null  float64
 9   COWMAIN       635925 non-null  float64
 10  FTPTMAIN      977017 non-null  object
 11  QUARTER       977017 non-null  object
 12  VOLUNTARY_PT  977017 non-null  bool
dtypes: bool(1), float64(4), int64(4), object(4)
memory usage: 97.8+ MB

# Export Final DF

In [186]:
FinalDF.to_csv('Datasets/FinalDF.csv', encoding='utf-8', index=False)

In [187]:
# End of this task